
-- Deal 테이블과 JOIN하는 테이블


-- Product_Deal
SELECT distinct p.pr_no, p.pr_title, p.pr_price, p.pr_rdate, p.mem_no as seller_no,
    d.deal_no, d.d_state, d.d_way, d.d_check, d.d_date, d.mem_no as buyer_no
    FROM product p, deal d
    ORDER BY d.deal_no DESC
    
 PR_NO PR_TITLE PR_PRICE PR_RDATE              SELLER_NO DEAL_NO D_STATE D_WAY    D_CHECK D_DATE                BUYER_NO
 ----- -------- -------- --------------------- --------- ------- ------- -------- ------- --------------------- --------
     1 제목         1000 2018-07-01 23:54:41.0         1      10 거래중  직거래   N       2018-06-30 19:44:26.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       9 거래중  직거래   N       2018-06-30 19:44:25.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       8 거래중  직거래   N       2018-07-01 19:44:24.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       7 거래중  택배거래 N       2018-07-02 19:44:23.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       6 거래중  택배거래 N       2018-07-02 19:44:22.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       5 거래중  직거래   N       2018-06-29 15:37:52.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       4 거래중  직거래   N       2018-06-29 15:37:51.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       3 거래중  직거래   N       2018-06-30 15:37:50.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       2 거래중  택배거래 N       2018-07-01 15:37:49.0        2
     1 제목         1000 2018-07-01 23:54:41.0         1       1 거래중  택배거래 N       2018-07-01 15:37:48.0        2
